In [49]:
from sqlalchemy import create_engine, text
from pandas import DataFrame

In [50]:
config = {
    'username': 'root',
    'password':'1234',
    'hostname': 'localhost',
    'port':9090,
    'database':'myschool',
    'charset':'utf8mb4'
}

con_str_tpl = "mariadb+pymysql://{username}:{password}@{hostname}:{port}/{database}?charset={charset}" 

con_str = con_str_tpl.format(**config)
print(con_str)

mariadb+pymysql://root:1234@localhost:9090/myschool?charset=utf8mb4

In [51]:
try:
    engine=create_engine(con_str)
    conn = engine.connect()
    print("Database connect success!!!")
except Exception as e:
    print("Database connect fail!!!",e)

Database connect success!!!

In [52]:
sql = text("SELECT id,name, grade, department_id FROM students where id=10101")

try:
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]",e)
    raise SystemExit

resultset = result.mappings().all()
print(resultset)

[{'id': 10101, 'name': '황진우', 'grade': 1, 'department_id': 101}]

In [53]:
student_id = input("검색할 학번을 입력하세요")

sql = text("SELECT id,name,grade, department_id FROM students WHERE id=:student_id")
params = {"student_id":student_id}

try:
    result = conn.execute(sql,params)
except Exception as e:
    print("[SQL Error]",e)
    raise SystemExit

resultset = result.mappings().all()
print(resultset)

[{'id': 10101, 'name': '황진우', 'grade': 1, 'department_id': 101}]

In [54]:
sql =text("SELECT id, dname, loc, phone, email FROM departments LIMIT 0,5")

try:
    result = conn.execute(sql)
except Exception as e:
    print("[SQL Error]",e)
    raise SystemExit

resultset = result.mappings().all()
print(resultset)

[{'id': 101, 'dname': '컴퓨터공학과', 'loc': '공학관', 'phone': '051-123-4567', 'email': 'cs@myschool.ac.kr'}, {'id': 102, 'dname': '소프트웨어학과', 'loc': '공학관', 'phone': '051-124-4567', 'email': 'media@myschool.ac.kr'}, {'id': 201, 'dname': '전자공학과', 'loc': '공학관', 'phone': '051-125-4567', 'email': 'ee@myschool.ac.kr'}, {'id': 202, 'dname': '기계공학과', 'loc': '공학관', 'phone': '051-126-4567', 'email': 'me@myschool.ac.kr'}, {'id': 203, 'dname': '건축학과', 'loc': '건축관', 'phone': '051-127-4567', 'email': 'arch@myschool.ac.kr'}]

In [55]:
print("총 %d건의 데이터 조회됨"%len(resultset))

tmpl = "학과번호:{id},학과이름:{dname},위치:{loc},연락처:{phone}, 이메일: {email}"

for row in resultset:
    print(tmpl.format(**row))

총 5건의 데이터 조회됨
학과번호:101,학과이름:컴퓨터공학과,위치:공학관,연락처:051-123-4567, 이메일: cs@myschool.ac.kr
학과번호:102,학과이름:소프트웨어학과,위치:공학관,연락처:051-124-4567, 이메일: media@myschool.ac.kr
학과번호:201,학과이름:전자공학과,위치:공학관,연락처:051-125-4567, 이메일: ee@myschool.ac.kr
학과번호:202,학과이름:기계공학과,위치:공학관,연락처:051-126-4567, 이메일: me@myschool.ac.kr
학과번호:203,학과이름:건축학과,위치:건축관,연락처:051-127-4567, 이메일: arch@myschool.ac.kr

In [56]:
df1  = DataFrame(resultset)
print (df1)

     dname                 email   id  loc         phone
0   컴퓨터공학과     cs@myschool.ac.kr  101  공학관  051-123-4567
1  소프트웨어학과  media@myschool.ac.kr  102  공학관  051-124-4567
2    전자공학과     ee@myschool.ac.kr  201  공학관  051-125-4567
3    기계공학과     me@myschool.ac.kr  202  공학관  051-126-4567
4     건축학과   arch@myschool.ac.kr  203  건축관  051-127-4567

In [57]:
df2 = DataFrame(resultset)
df2

     dname                 email   id  loc         phone
0   컴퓨터공학과     cs@myschool.ac.kr  101  공학관  051-123-4567
1  소프트웨어학과  media@myschool.ac.kr  102  공학관  051-124-4567
2    전자공학과     ee@myschool.ac.kr  201  공학관  051-125-4567
3    기계공학과     me@myschool.ac.kr  202  공학관  051-126-4567
4     건축학과   arch@myschool.ac.kr  203  건축관  051-127-4567

In [58]:
keyword = input("검색할 교수의 이름을 입력하세요.")
sql = text("""SELECT 
           p.id AS 교수번호,name AS 이름, position AS직급, sal AS 급여,
           comm AS 보직수당, hiredate AS 입사일시, dname AS 소속학과
           FROM professors p
           INNER JOIN departments d on p.department_id=d.id
           WHERE name like concat('%',:keyword, '%')""")

try:
    result = conn.execute(sql,{"keyword":keyword})
except Exception as e:
    print ("[SQL Error]",e)
    raise SystemExit

resultset = result.mappings().all()
df = DataFrame(resultset)
df

Empty DataFrame
Columns: []
Index: []

In [64]:
sql = text("""
        INSERT INTO students (
           name, user_id, grade, idnum, birthdate, phone, height,
           weight,email,gender,status,admission_date, department_id
           )VALUES (
            :name, :user_id, :grade,MD5(:idnum),:birthdate,:phone,:height,
           :weight, :email,:gender,:status, :admission_date,:department_id
           )
           """)
new_student = {
    "name":'나신입',"user_id":'newbie',"grade":1,"idnum":'9205171000000',
    "birthdate": '2024-03-15',"phone":'010-9876-5432',"height":175,
    "weight":82, "email":'newbi@myschool.ac.kr',"gender":'남',
    "status": '재학',"admission_date":'2028-02-12',"department_id":101
    }

In [66]:
try:
    result = conn.execute(sql, new_student)
    affected_rows = result.rowcount
    conn.commit()

    pk_result = conn.execute(text("SELECT LAST_INSERT_ID()"))
    pk=pk_result.scalar()

except Exception as e:
    print("SQL Error:",e)
    conn.rollback()
    raise SystemExit

print("저장된 행의 수:",affected_rows,", 신규학생 ID:",pk)

저장된 행의 수: 1 , 신규학생 ID: 10183

In [68]:
sql = text("UPDATE students SET phone=:phone, email=:email WHERE id=:id")

params = {"phone": "010-1234-5678","email": "jinwoo.h@myschool.ac.kr","id":10102}

try:
    result = conn.execute(sql,params)
    conn.commit()
except Exception as e:
    print(f"데이터 수정 오류:{e}")
    conn.rollback()
    raise SystemExit

print("수정된 데이터 수:", result.rowcount)

수정된 데이터 수: 1

In [70]:
sql = text("DELETE FROM enrollments where  student_id=:id")

params ={"id":10102}

try: 
    result = conn.execute(sql,params)
    conn.commit()
except Exception as e:
    print(f"데이터 삭제 오류: {e}")
    conn.rollback()
    raise SystemExit

print("삭제된 데이터 수:", result.rowcount)

삭제된 데이터 수: 0

In [72]:
from pandas import read_sql

In [74]:
sql = text("SELECT id,name,position,sal,comm FROM professors WHERE sal>500")

try:
    df = read_sql(sql,conn)
except Exception as e:
    print("SQL Error:",e)
    raise SystemExit

df

     id name position      sal  comm
0  9902  허경희     전임강사      552   NaN
1  9903  전종수      조교수      508   NaN
2  9910  강영호      조교수      593   NaN
3  9915  이옥순       교수      548  22.0
4  9918  오미영      부교수      578   NaN
5  9928  이영길      조교수      526  14.0
6  9931  박태수      부교수      510   NaN
7  9932  최정훈      부교수      520   NaN
8  9933  박태수      부교수  5100000   NaN

In [77]:
min_height = int(input("키의 하한값을 입력하세요."))
max_height = int(input("키의 상한값을 입력하세요."))

sql = text("""
           SELECT id, name,grade,height,weight,gender
           FROM students
           WHERE height BETWEEN :min AND :max""")
        
try:
    df= read_sql(sql,conn,params={"min": min_height, "max":max_height})
except Exception as e:
    print("SQL Error:",e)

    raise SystemExit

df

       id name  grade  height  weight gender
0   10104  김서연      4     171      62      남
1   10105  박미영      1     172      67      여
2   10107  고정숙      2     168      50      남
3   10108  송영미      2     173      67      남
4   10111  고미영      3     163      86      여
5   10112  장하윤      2     165      80      여
6   10121  한명자      4     163      79      남
7   10125  최정미      4     165      75      여
8   10126  송정식      4     179      48      남
9   10127  박은영      2     162      57      여
10  10129  김아름      2     160      71      여
11  10131  권정수      2     162      63      남
12  10135  박가람      2     170      60      여
13  10137  한영자      1     165      68      여
14  10139  양영수      2     167      63      남
15  10140  손영호      4     166      48      남
16  10144  권경숙      2     165      87      남
17  10145  배혜진      2     160      56      여
18  10146  김은정      2     167      55      남
19  10147  권민준      4     172      64      남
20  10148  김서연      1     167      67      여
21  10149  김자영      1     166      56      여
22  10151  심지현      2     173      72      남
23  10153  손지후      4     174      88      남
24  10154  오영미      3     168      58      여
25  10155  김수민      4     163      77      여
26  10157  백승현      2     180      84      남
27  10158  박민석      4     175      60      남
28  10159  구영미      4     164      56      여
29  10160  김서연      2     179      87      여
30  10161  이서윤      4     160      75      여
31  10162  김현지      2     167      73      남
32  10163  이광수      2     164      69      남
33  10165  박은영      4     180      45      여
34  10167  이진우      2     179      53      남
35  10169  강재현      4     167      71      여
36  10170  황동현      3     164      86      남
37  10172  김숙자      4     166      68      남
38  10174  이지민      4     162      49      남
39  10176  장지후      1     172      62      남
40  10177  김하늘      1     162      51      여
41  10178  박세린      2     169      56      여
42  10179  장지후      1     172      62      남
43  10180  장지후      1     172      62      남
44  10182  나신입      1     175      82      남
45  10183  나신입      1     175      82      남

In [80]:
df.to_csv("학생목록.csv",encoding="utf-8")

In [ ]:
df.to_excel("학생목록.xlsx")